/**
  ******************************************************************************
  * @file    Timer2.h
  * @brief   定时器3驱动头文件
  ******************************************************************************
  */

#ifndef __TIMER2_H
#define __TIMER2_H

#include "stdint.h"

/*============================ 外部变量 ============================*/

extern volatile uint32_t tim3_ms_counter;  /**< 10us计数器，每10us加1（100kHz） */

/*============================ 函数声明 ============================*/

/**
 * @brief  定时器3初始化
 * @note   配置TIM3产生1kHz中断，用于ECG采样
 */
void Timer3_Init(void);

#endif
